<h1><img src="../images/icon.mouse_64.jpg" alt="icon.mouse_64.jpg" hspace="20" width="64" height="64"><a name="mouse_controls">Controles de rat&oacute;n</a></h1>
<hr>
<p>El Control de Rat&oacute;n en BePDF agrega un nivel de gracia que los usuarios han llegado a amar y esperar de las aplicaciones de BeOS.</p>

<h2>Familiarizaci&oacute;n</h2>
<p>BePDF se pens&oacute; para usarse con un rat&oacute;n de tres botones, pero el <b>Bot&oacute;n Derecho del Rat&oacute;n</b> (BDR) puede simularse al presionar [<b>CTRL</b>] y el <b>Bot&oacute;n Izquierdo del Rat&oacute;n</b> (BIR). Similarmente, el <b>Bot&oacute;n Medio del Rat&oacute;n</b> (BMR) puede simularse al presionar [<b>MAY&Uacute;SCULAS</b>] (SHIFT) mientras se hace clic con el <b>BIR</b>.</p>
<ul>
<li><p>Haga clic con el <b>BIR</b> sobe un enlace para abrir una nueva ventana BePDF para enlaces PDF o abrir al navegador predeterminado para enlaces URL.</p></li>
<li><p>Haga clic y mantenga el <b>BIR</b> sobre el espacio libre para posicionar el documento.</p></li>
<li><p>Mueva la <b>Rueda del Rat&oacute;n</b> arriba o abajo para desplazar el documento.</p></li>
<li><p>Presione la tecla <b>Windows (Logo) Izquierda</b> y mueva la <b>Rueda del Rat&oacute;n</b> para desplazarse varias l&iacute;neas dentro del documento.</p></li>
<li><p>Presione y mantenga el <b>BDR</b> para crear un &aacute;rea de selecci&oacute;n.</p></li></ul>

<h2>Escalar</h2>
<ul>
<li><p>Hacer clic y arrastrar el <b>BMR</b> permite al usuario escalar sobre una selecci&oacute;n rectangular, pero s&oacute;lo si el rect&aacute;ngulo es suficientemente largo. El l&iacute;mite del tama&ntilde;o es permitir al usuario abortar la funci&oacute;n de escalado si se presion&oacute; equivocadamente el bot&oacute;n del rat&oacute;n.<br>
Esta caracter&iacute;stica puede tambi&eacute;n usarse para determinar la funci&oacute;n de un bot&oacute;n espec&iacute;fico del rat&oacute;n al hacer clic y mantener el bot&oacute;n del rat&oacute;n: tanto una lupa (para escalar) o un par de tijeras (para seleccionar) se mostrar&aacute;n.</p></li>
<li><p>Presionar la tecla [<b>CTRL</b>] mientras se rota la <b>Rueda del Rat&oacute;n</b> (para usuarios con "ratones con rueda") permitir&aacute; al usuario escalar a una vista mayor (<b>rueda hacia arriba</b>) o menor (<b>rueda hacia abajo</b>) en un documento.</p></li></ul>

<h2>Usar selecciones</h2>
<p>Al presionar [<b>CTRL</b>] y hacer clic tanto con el <b>BDR</b> como con el <b>BIR</b> para seleccionar un &aacute;rea rectangular y copiar sus contenidos al portapapeles (tanto texto como im&aacute;genes pueden incluirse en la selecci&oacute;n), el texto puede pegarse dentro de cualquier aplicaci&oacute;n apropiada. De manera similar, la imagen pude pegarse dentro de Gobe Productive Graphics o partes o aplicaciones de procesamiento de im&aacute;genes.</p>

<h2>Arrastrar y soltar</h2>
<ul><li><p>Haga clic con el <b>BIR</b> sobre una selecci&oacute;n y arr&aacute;strela a la ventana del Tracker para crear un recorte de texto.</p></li>
<li><p>Haga clic con el <b>BDR</b> para iniciar un arrastre que le permita seleccionar el formato de archivo (tanto texto como gr&aacute;ficos) para el recorte. El tipo de formatos de imagen disponible depende del la Amplitud de Color [ColorSpace] seleccionada en la ventana de Preferencias Desplegar en BePDF. Una selecci&oacute;n de Amplitud de Color de 32bpp resultar&aacute; en la mejor calidad de imagen.</p></li>
<li><p>Mantenga [<b>May&uacute;sculas</b>] (Shift) y haciendo clic arrastre usando el <b>BIR</b> para escalar la vista a la selecci&oacute;n rectangular realizada.</p></li></ul>
<p>Por favor tenga en cuenta que si ha configurado su rat&oacute;n con una configuraci&oacute;n para zurdos debe sustituir <b>BIR</b> por <b>BDR</b> y viceversa en las instrucciones de arriba. Tambi&eacute;n, cuando la tecla [<b>CTRL</b>] se selecciona como tecla de atajo dentro de la aplicaci&oacute;n Preferencias de Men&uacute; de BeOS, se debe sustituir [<b>ALT</b>] por [<b>CTRL</b>] cuando se usen los atajos de teclado de BePDF.</p>

</div>
</body>
</html>
