<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<title>BePDF - Maus Bedienung</title>
<meta name="author" content="Celerick Stephens, Michael Pfeiffer">
<meta name="date" content="2009-01-29">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="content-language" content="de">

<link rel="stylesheet" type="text/css" href="../BePDF-docu.css" />

</head>
<body>
<div class="logo">
	<a href="../index.html"><img src="../images/BePDF-logo.png" alt="logo" border="0" width="368" height="70" /></a>
	<div class="title">Maus Bedienung</div>
</div>
<div class="topnav">
	<p>
		<a href="table_of_contents.html">Inhalt</a>
		&#160;&#160;&#160;
		Zur&uuml;ck: <a href="keyboard_commands.html">Tastaturk&uuml;rzel</a>
		&#160;&#160;&#160;
		Weiter: <a href="tracker_attributes.html">Tracker Attribute</a>
	</p>
</div>

<div class="content">

<h1><img src="../images/icon.mouse_64.jpg" alt="icon.mouse_64.jpg" hspace="20" width="64" height="64"><a name="mouse_controls">Maus Bedienung</a></h1>
<hr>
<p>Per Maus l&auml;sst sich BePDF elegant bedienen, so wie der Benutzer das von Anwendungen unter BeOS gewohnt ist.</p>

<h2>Navigation</h2>
<p>BePDF l&auml;sst sich am besten mit einer Drei-Button Maus benutzen. Nicht vorhandene Buttons lassen sich jedoch mit zus&auml;tzlichen Tasten zusammen mit einem Klick simulieren: Der <b>Rechte Maus Button</b> (RMB) durch Halten der [<b>STRG</b>] Taste und einem Klick mit dem <b>Linken Maus Button</b> (LMB). Der <b>Mittlere Maus Button</b> (MMB) durch Halten der [<b>SHIFT</b>] Taste und einem <b>LMB</b>.</p>
<ul>
<li><p>Ein Klick mit dem <b>LMB</b> auf einen Link &ouml;ffnet ein neues BePDF Fenster im Falle eines PDF Links und den Standard Browser bei URLs.</p></li>
<li><p>H&auml;lt man den <b>LMB</b> &uuml;ber einen leeren Bereich gedr&uuml;ckt, l&auml;sst sich das Dokument hin und her schieben.</p></li>
<li><p>Mit dem <b>Mausrad</b> l&auml;sst sich das Dokument rauf und runter scrollen.</p></li>
<li><p>H&auml;lt man gleichzeitig die <b>Linke Windows Taste</b> gedr&uuml;ckt, scrollt man mit dem <b>Mausrad</b> gleich um mehrere Zeilen.</p></li>
<li><p>Mit dem <b>RMB</b> l&auml;sst sich ein Markierungsrahmen aufziehen.</p></li></ul>

<h2>Zoomen</h2>
<ul>
<li><p>Mit dem <b>MMB</b> l&auml;sst ein Rahmen aufziehen auf dem beim Loslassen gezoomt wird. Das funktioniert nur ab einer bestimmten Gr&ouml;&szlig;e, um die M&ouml;glichkeit zu haben die Zoomfunktion abzubrechen, falls man sich verklickt hat.<br>
Ein ge&auml;nderter Mauszeiger l&auml;sst die Funktion des entsprechenden Maus Buttons erkennen: entweder eine Lupe (f&uuml;r Zoomen) oder eine Schere (f&uuml;r Markieren).</p></li>
<li><p>H&auml;lt man die [<b>STRG</b>] Taste gedr&uuml;ckt w&auml;hrend man am Mausrad dreht (so die Maus eins hat), vergr&ouml;&szlig;ert man (<b>Mausrad hoch</b>) oder verkleinert man (<b>Mausrad runter</b>) die Ansicht.</p></li></ul>

<h2>Verwendung von Auswahlen</h2>
<p>H&auml;lt man die [<b>STRG</b>] Taste gedr&uuml;ckt w&auml;hrend man mit dem <b>RMB</b> oder <b>LMB</b> einen Auswahlrahmen zieht, wird der Inhalt in die Zwischenablage kopiert. Das funktioniert mit Text genauso wie mit Bildern. Aus der Zwischenablage k&ouml;nnen die Daten anschlie&szlig;end in entsprechenden Anwendungen zur Weiterverarbeitung eingef&uuml;gt werden, z.B. einen Texteditor oder Gobe's Bildverarbeitung.</p>

<h2>Drag&Drop</h2>
<ul><li><p>Klickt man mit dem <b>LMB</b> auf eine Auswahl und zieht sie in ein Trackerfenster, wird dort eine Datei mit dem entsprechenden Inhalt abgelegt.</p></li>
<li><p>Benutzt man den <b>RMB</b> f&uuml;r den drag&drop einer Auswahl, hat man die M&ouml;glichkeit das Dateiformat f&uuml;r die ausgeschnittenen Daten festzulegen. Bei Bildausschnitten h&auml;ngen die zur Verf&uuml;gung stehenden Formate von BePDFs Einstellungen der Anzeige (Farbraum) ab. 32bpp liefert die qualitativ besten Ergebnisse.</p></li>
<li><p>H&auml;lt man die [<b>SHIFT</b>] Taste gedr&uuml;ckt w&auml;hrend man mit dem <b>LMB</b> klickt und zieht, wird auf den Auswahlrahmen vergr&ouml;&szlig;ert.</p></li></ul>
<p>Sollte die Maus f&uuml;r Linksh&auml;nder konfiguriert sein, muss bei obiger Beschreibung <b>LMB</b> und <b>RMB</b> getauscht werden. Ebenso ist statt [<b>STRG</b>] die [<b>ALT</b>] Taste zu benutzen, falls in den Menu Preferences des Systems [<b>STRG</b>] als Kommando Tastaturk&uuml;rzel benutzt wird.</p>

</div>
</body>
</html>
