<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<title>BePDF - Traducir</title>
<meta name="author" content="Celerick Stephens, Michael Pfeiffer">
<meta name="date" content="2009-01-29">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="content-language" content="es">

<link rel="stylesheet" type="text/css" href="../BePDF-docu.css" />

</head>
<body>
<div class="logo">
	<a href="../index.html"><img src="../images/BePDF-logo.png" alt="logo" border="0" width="368" height="70" /></a>
	<div class="title">Traducir</div>
</div>
<div class="topnav">
	<p>
		<a href="table_of_contents.html">Contenidos</a>
		&#160;&#160;&#160;
		Anterior: <a href="printing.html">Imprimir</a>
		&#160;&#160;&#160;
		Siguiente: <a href="get_bepdf_for_your_site.html">Obtener BePDF para Su Sitio Web</a>
	</p>
</div>

<div class="content">

<h1><img src="../images/icon.world_64.jpg" alt="icon.world_64.jpg" hspace="20" width="64" height="64"><a name="localization">Traducci&oacute;n</a></h1>
<hr>
<p>BePDF versi&oacute;n 0.7.6 Alpha 2 y posteriores gratamente soporta traducciones.</p>
<p>Para cada idioma soportado hay un archivo .catalog en el subdirectorio &quot;locale&quot; del directorio donde BePDF est&eacute; instalado.</p>
<p>Si un archivo <i>[su idioma].catalog</i> ya existe, simplemente abra la ventana de preferencias en BePDF y seleccione el idioma deseado. La pr&oacute;xima vez que abra a BePDF, la nueva preferencia de idioma se activar&aacute;.</p>
<p>Si no existe un <i>[su idioma].catalog</i> se puede f&aacute;cilmente crear uno.</p>
<ul><li><p>Copie el archivo "template.catalog" con el nombre <i>"[su idioma].catalog"</i> donde [su idioma] es el nombre del idioma deseado, en el idioma deseado.</p></li>
<li><p>Abra <i>[su idioma].catalog</i> con StyledEdit, y salte la primera l&iacute;nea y la &uacute;ltima l&iacute;nea del archivo.</p></li>
<li><p>Remplace la segunda l&iacute;nea (debajo de "CatalogName") con el nombre de su idioma, de nuevo en su idioma.</p></li>
<li><p>Remplace la l&iacute;nea debajo de "CatalogLanguage" con el nombre de su idioma en ingl&eacute;s.</p></li>
<li><p>Remplace la l&iacute;nea debajo de "CatalogAuthor" con su nombre. CatalogName y CatalogAuthor se desplegar&aacute;n en la ventana Acerca de.</p></li>
<li><p>Las l&iacute;neas subsecuentes aparecen en pares de dos l&iacute;neas: la primera es un identificador el cual no debe cambiar, y la segunda l&iacute;nea es el texto en ingl&eacute;s que debe ser traducido. Esta l&iacute;nea debe reemplazarse con la traducci&oacute;n en su idioma.<br>
Por favor note que algunas l&iacute;neas tendr&aacute;n un espacio al principio o un espacio al final; &iexcl;La l&iacute;nea traducida del texto deber&iacute;a tenerla tambi&eacute;n&#33;</p></li></ul>
<p>Si desea ayudar a otros usuarios de BePDF, mande <i>[su idioma].catalog</i> en un archivo zip (para garantizar que el octavo bit de cada byte no se pierda cuando se mande por correo electr&oacute;nico) a Michael Pfeiffer y por favor determine si desea ser mencionado en la documentaci&oacute;n como traductor con o sin su direcci&oacute;n de correo electr&oacute;nico y/o un enlace a su p&aacute;gina Web. El archivo cat&aacute;logo se incluir&aacute; en el siguiente lanzamiento de BePDF.</p>

</div>
</body>
</html>
