<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<title>BePDF - Imprimir</title>
<meta name="author" content="Celerick Stephens, Michael Pfeiffer">
<meta name="date" content="2009-01-29">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="content-language" content="es">

<link rel="stylesheet" type="text/css" href="../BePDF-docu.css" />

</head>
<body>
<div class="logo">
	<a href="../index.html"><img src="../images/BePDF-logo.png" alt="logo" border="0" width="368" height="70" /></a>
	<div class="title">Imprimir</div>
</div>
<div class="topnav">
	<p>
		<a href="table_of_contents.html">Contenidos</a>
		&#160;&#160;&#160;
		Anterior: <a href="creating_and_editing_annotations.html">Crear y Editar Anotaciones</a>
		&#160;&#160;&#160;
		Siguiente: <a href="localization.html">Traducir</a>
	</p>
</div>

<div class="content">

<h1><img src="../images/icon.printer_64.jpg" alt="icon.printer_64.jpg" hspace="20" width="64" height="64"><a name="printing">Imprimir</a></h1>
<hr>
<p>BePDF asiste en la salida del documento a trav&eacute;s del uso de una interfaz gr&aacute;fica intuitiva.</p>
<p>Los archivos PDF pueden imprimirse seleccionando &quot;Imprimir&quot; del men&uacute; Archivo o haciendo clic en el icono Imprimir en la barra de iconos. El di&aacute;logo Selecciones de Impresi&oacute;n consta de tres secciones.</p>

<h2>General</h2>
<p>La secci&oacute;n General permite formatear la salida general del documento PDF.</p>
<img src="../images/image.print.settings.png" alt="image.print.settings.png" width="210" height="259">
<p><b>DPI</b><br>
Selecciona la resoluci&oacute;n en DPI (Puntos por pulgada, Dots Per Inch en ingl&eacute;s) que se usar&aacute;n para representar una p&aacute;gina PDF. Para la mejor calidad este valor deber&iacute;a concordar con la resoluci&oacute;n de la impresora que se especifique en la configuraci&oacute;n o el di&aacute;logo selecci&oacute;n de trabajos de su controlador de impresora.<br>
Note que imprimir a altas resoluciones puede consumir grandes cantidades de memoria.</p>
<p><b>P&aacute;gina</b><br>
Seleccionar &quot;Todas las p&aacute;ginas&quot; imprimir&aacute; todas las p&aacute;ginas del documento secuencialmente. Seleccionar &quot;P&aacute;ginas Impares&quot; y &quot;P&aacute;ginas Pares&quot; permite imprimir &uacute;nicamente las p&aacute;ginas pares o impares. Esto es &uacute;til cuando se generen salidas de estilo de libro en doble p&aacute;gina.</p>
<p><b>Orden</b><br>
Seleccionar &quot;Normal&quot; o &quot;Reversa&quot; instruye a BePDF a imprimir las p&aacute;ginas en secuencia ascendente (1, 2, 3, ...) o en orden descendente (5, 4, 3, ...) respectivamente.</p>
<p><b>Modo</b><br>
Seleccionar &quot;Color&quot; o &quot;Escala de Grises&quot; instruye a BePDF el seleccionar entre los modos a color o escala de grises (blanco y negro). Se requiere una impresora a color para impresi&oacute;n a color.</p>
<p><b>Rotaci&oacute;n</b><br>
Seleccionar un &aacute;ngulo de rotaci&oacute;n selecciona la orientaci&oacute;n del documento en la p&aacute;gina impresa. Cero grados es como el documento aparece en la pantalla. El documento puede orientarse en incrementos de 90 grados, siendo el &aacute;ngulo de rotaci&oacute;n en el sentido contrario a las manecillas del reloj.</p>
<p><b>Escala</b><br>
Escala permite al usuario seleccionar la escala del documento a imprimir. Una selecci&oacute;n de escala de 100% es el tama&ntilde;o del documento real.</p>
<p><b>Tama&ntilde;o de P&aacute;gina</b><br>
La secci&oacute;n Tama&ntilde;o de P&aacute;gina del di&aacute;logo de impresi&oacute;n permite al usuario determinar el tama&ntilde;o de p&aacute;gina para el n&uacute;mero de p&aacute;gina del documento ingresado dentro del campo de entrada. Esta funci&oacute;n puede usarse para ayudar en escalar un documento para ajustar a un cierto tama&ntilde;o de papel durante la impresi&oacute;n.</p>
<p>Despu&eacute;s de seleccionar las opciones deseadas, presione el bot&oacute;n &quot;Imprimir&quot; en el cuadro de di&aacute;logo para iniciar el demonio de impresi&oacute;n de BeOS. Si el controlador de impresora instalado est&aacute; seleccionardo para que el usuario seleccione opciones de impresi&oacute;n, adicionales selecciones de p&aacute;gina y di&aacute;logos de impresi&oacute;n aparecer&aacute;n. Si los valores en estos di&aacute;logos se seleccionan en conflicto con los anteriormente seleccionados en el di&aacute;logo de BePDF, el controlador de la impresora sobreescribir&aacute; los valores de BePDF.</p>

</div>
</body>
</html>
